import random

first_names = ["Александр", "Владислав", "Екатерина", "Ирина", "Михаил", "Наталья", "Павел", "Светлана", "Татьяна", "Юлия", "Олег", "Анна", "Денис", "Алексей", "Елена", "Дмитрий", "Иван", "Ольга", "Андрей", "Николай", "Ксения", "Евгений", "Лариса", "Сергей", "Мария"]
last_names = ["Иванов", "Смирнов", "Кузнецов", "Попов", "Васильев", "Петров", "Соколов", "Михайлов", "Новиков", "Федоров", "Морозов", "Волков", "Зайцев", "Соловьев", "Козлов", "Лебедев", "Семенов", "Егоров", "Павлов", "Козлова", "Степанова", "Никитина", "Макаров", "Андреев", "Ковалев"]
patronymic_names = ["Александрович", "Владимирович", "Егорович", "Ивановна", "Михайловна", "Николаевич", "Петровна", "Сергеевич", "Федорович", "Яковлевна", "Андреевна", "Борисович", "Васильевна", "Дмитриевна", "Евгеньевна", "Ждановна", "Захарович", "Игоревна", "Константинович", "Леонидовна", "Максимович", "Никитична", "Олеговна", "Павлович", "Романовна"]

# Генерируем случайные значения из столбцов
def generate_random_person():
    last_name = random.choice(last_names)    # Выбираем случайную фамилию из списка last_names
    first_name = random.choice(first_names)  # Выбираем случайное имя из списка first_names
    patronymic_name = random.choice(patronymic_names)  # Выбираем случайное отчество из списка patronymic_names
    full_name = last_name + ' ' + first_name + ' ' + patronymic_name
    return full_name  # Возвращаем кортеж значений


# Генерируем и печатаем 25 случайных персон
# for _ in range(26):
#     person = generate_random_person()
#     print(*person) 